//From Part 5, filtering for precise results

OfficeActivity
| where TimeGenerated > ago(24h)
| where UserId has "rodtrent"
| where RecordType == "ExchangeItem"
| where Operation == "Send"
| project UserId, ClientIP, OriginatingServer 
